<img src="iteso_horizontal.png">

<h1><center>DEPARTAMENTO DE MATEMÁTICAS Y FÍSICA</center></h1>

<h1><center>SOLUCION: Tarea 1 : Ejercicios con librería Pandas</center></h1>

<h1> Nombre: </h1>
<hr>

**1.1 importar la librería de pandas**

In [24]:
# código aquí

In [25]:
import pandas as pd

**1.2 Lea el archivo bank.csv que se encuentra en la carpeta raíz. ¡Presta mucha atención a la ubicación del archivo .csv!.**

In [23]:
df = pd.read_csv('bank.csv')

**1.3 Mustre las primero 5 filas del dataset**

In [ ]:
# código aquí

In [18]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

**2.1 Calcule el promedio de la edad de las personas del dataset**

In [ ]:
# código aquí

In [47]:
df['age'].mean()

41.17009511170095

**2.2 ¿Cuál es el status marital de la persona más joven en el dataset?**

In [52]:
# código aquí

In [49]:
df['age'].idxmin()

503

In [56]:
df.iloc[503]['marital']

'single'

**2.3 ¿Cuántas categorías de trabajos únicos existen en el dataset?**

In [57]:
# código aquí

In [58]:
df['job'].nunique()

12

**3.1 Muestre cuántas personas hay por categoría de trabajo**

In [20]:
# código aquí

In [21]:
df['job'].value_counts()

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

**3.2 ¿Cuál es el porcentaje de las personas en el dataset que están casadas?**

In [22]:
# código aquí

In [28]:
# Many, many ways to do this one! Here is just one way:
100*df['marital'].value_counts()['married']/len(df)

# df['marital].value_counts()

61.86684361866843

**3.3 En el dataset existe una columna etiquetada como: "default". Use el comando .map() para crear una nueva columna llamada "default_code" que contenga el valor 0 si el valor de la columna es "no", o 1 si el valor en la columna esta etiquetada como "si". Muestre los 5 primeros valores de esta nueva columna**

In [29]:
df['default code'] = df['default'].map({'no':0,'yes':1})

In [30]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

**3.4 Usando el método pandas .apply (), cree una nueva columna llamada "marital_code". Esta columna solo contendrá un código abreviado de la posible primera letra del estado civil. (Por ejemplo, "m" para "casado", "s" para "soltero", etc.**

In [ ]:
# código aquí

In [31]:
df['marital code'] = df['marital'].apply(lambda status: status[0])

In [32]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code,marital code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,m
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,m
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,s
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,m
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,m

**4.1 ¿Cuál fue el trabajp con duración más larga?**

In [ ]:
# código aquí

In [33]:
df['duration'].max()

3025

**4.2 ¿Cuál es el nivel de educación más común para las personas que están desempleadas?**

In [ ]:
# código aquí

In [39]:
df[df['job']=='unemployed']['education'].value_counts()

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

**4.3 ¿Cuál es la edad promedio para estar desempleado?**

In [45]:
# código aquí

In [53]:
df[df['job']=='unemployed']['age'].mean()

40.90625